#!/usr/bin/env python
# -*- coding: utf-8 -*-


class Texts:
    STANDART_GAME_FINISH = [
        u"Упражнение не завершено до конца",
        u"Постарайтесь закончить его в следующий раз",
        u"(для продолжения нажмите Enter)"
    ]

    STANDART_GAME_SUCCESS_FINISH = [
        u"Поздравляем! Вы успешно выполнили упражнение",
        u"Продолжайте регулярные тренировки!",
        u"(для продолжения нажмите Enter)"
    ]

    STANDART_GAME_GREETING = [
        u"Для выполнения данного упражнения займите удобное положение",
        u"перед монитором. Не двигая головой, следите за перемещением ",
        u"объекта по экрану!",
        u"P.S. чтобы объект начал движение, наведите на него курсор мышки"
    ]

    LAZY_GAME_FINISH = [
        u"Упражнение не завершено до конца",
        u"Постарайтесь закончить его в следующий раз",
        u"(для продолжения нажмите Enter)"
    ]

    LAZY_GAME_SUCCESS_FINISH = [
        u"Поздравляем! Вы успешно выполнили упражнение",
        u"Продолжайте регулярные тренировки!",
        u"(для продолжения нажмите Enter)"
    ]

    LAZY_GAME_GREETING = [
        u"Для выполнения данного упражнения займите удобное положение",
        u"перед монитором. Не двигая головой, следите за перемещением ",
        u"объекта по экрану!"
    ]

    FACE_DETECTION_GAME_MESSAGE = [
        u"В данном режиме нельзя двигать головой",
        u"Постарайтесь держать ее на месте"
    ]

    FACE_DETECTION_GAME_GREATING = [
        u"Постарайтесь не шевелить головой"
    ]

    FACE_DETECTION_GAME_FINISH = [
        u"Игра не завершена",
        u"Попробуйте еще раз"
    ]

    FACE_DETECTION_GAME_SUCCESS_FINISH = [
        u"Поздравляем",
        u"Вы выиграли, продолжайте в том же духе"
    ]